Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer.SecondEnd Property
 The end point of the EdgeChamfer.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point SecondEnd { get; set; }
Public Property SecondEnd As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
EdgeChamfer Class
Tekla.Structures.Model Namespace